using Microsoft.EntityFrameworkCore.Migrations;

#nullable disable

namespace NovelNest.Infrastructure.Migrations
{
    public partial class SeededMoreBooks : Migration
    {
        protected override void Up(MigrationBuilder migrationBuilder)
        {
            migrationBuilder.UpdateData(
                table: "AspNetUsers",
                keyColumn: "Id",
                keyValue: "6d5800ce-d726-4fc8-83d9-d6b3ac1f591e",
                columns: new[] { "ConcurrencyStamp", "PasswordHash", "SecurityStamp" },
                values: new object[] { "6ad12700-11eb-4486-9141-73b5f0e47e04", "AQAAAAEAACcQAAAAEPAs+fiQ+zIbX9gw+wT0IY2u+aKUOL2GP3I7YpkSKoOnUVTxiCR6PkEQh8wSt44HiA==", "5c93fe23-8f8e-42cd-9524-2e719d8b90fa" });

            migrationBuilder.UpdateData(
                table: "AspNetUsers",
                keyColumn: "Id",
                keyValue: "c2f14bf7-ffdd-47a4-90b3-f2309486fae9",
                columns: new[] { "ConcurrencyStamp", "PasswordHash", "SecurityStamp" },
                values: new object[] { "6966be5e-c4f2-4ac1-8c0d-e19ad7055fb6", "AQAAAAEAACcQAAAAEJk/INag6AIJcmYh8c0Vr0CLiHBXl/sMoOSSvBfcJJ7br8Y7qNxXTDPUJyrNkQRy3g==", "3404696d-6fec-41aa-9718-330d5e5602d7" });

            migrationBuilder.UpdateData(
                table: "AspNetUsers",
                keyColumn: "Id",
                keyValue: "dea12856-c198-4129-b3f3-b893d8395082",
                columns: new[] { "ConcurrencyStamp", "PasswordHash", "SecurityStamp" },
                values: new object[] { "5cf1c9e7-0cbd-4483-8c17-93199b8f4fff", "AQAAAAEAACcQAAAAEC1v+JUDxxXv3zE+OiWjReJwjWDX1wMIAlKMgmdz2vgVCjU5aOziLYYsJc2MTSXo6g==", "0517bd55-6913-4b8a-b298-dd341bebe585" });

            migrationBuilder.InsertData(
                table: "Books",
                columns: new[] { "Id", "Author", "CoverTypeId", "Description", "GenreId", "ImageUrl", "Pages", "Price", "PublishingHouse", "Title", "YearPublished" },
                values: new object[,]
                {
                    { 6, "Стивън Кинг", 1, "Който го намери, за него си е! „Събуди се, гений!“ – още с първото изречение в новия си роман Стивън Кинг ни стиска в хватката си и не ни пуска до самия край. Геният е Джон Ротстийн (авторът, създал трилогията с култовия герой Джими Голд), който от десетилетия не е публикувал нова книга и живее като отшелник. А грубото подмятане е отправено от Морис Белами, младеж, обсебен от Джими Голд. Морис кипи от гняв – не стига че любимият му писател е престанал да твори, ами преди това е превърнал бунтаря Джими Голд в конформист, който загърбва идеалите си в името на кариера в рекламата и на еснафското благополучие. Ротстийн трябва да си плати. С живота си! Морис го застрелва и взема парите от скрития в дрешника сейф. Само че истинското съкровище не са хилядите долари, а тетрадки, изписани на ръка от Ротстийн, и съдържащи най-малко още един роман за Джими Голд. Морис заравя плячката си, предвкусвайки как скоро ще чете продължението на трилогията за Беглецът, но – каква ирония на съдбата! – е арестуван и изпратен в затвора за друго престъпление. След дълги години момче на име Питър Саубърс случайно се натъква на заровения сандък със съкровището и сега Бил Ходжис, Холи Гибни и Джером Робинсън – незабравимото трио от „Мистър Мерцедес“ – трябва да защитят Пит и семейството му от коварния, жадуващ за отмъщение Морис, излязъл на свобода след трийсет и пет години зад решетките. За първи път след „Мизъри“ Стивън Кинг се връща към темата за тънката граница между пристрастеността към измислен герой и фанатизма. „Търси се“ е грабващ трилър, но и размисъл за начина, по който литературата формира живота ни – за добро или за зло, - ала винаги необратимо.", 4, "https://cdn.ozone.bg/media/catalog/product/cache/1/image/a4e40ebdc3e371adff845072e1c73f37/t/a/93afd46bc6f480cdee09e8c4ced2d74a/tarsi-se-31.jpg", 480, 24.00m, "Pleiad", "Търси се", 2015 },
                    { 7, "Хенрик Сенкевич", 2, "Пълно луксозно издание на един от най-четените романи за XX век\r\n\r\nРим по време на управлението на Нерон е привидно бляскаво място. Организират се богати пирове и поетични състезания, а забавленията в Циркус Максимус сякаш нямат край. От другата страна на монетата обаче са развратът и липсата на морал, бедността на народа и лудостта на императора, който подпалва собствения си град.\r\n\r\nВ тези мрачни дни на упадъка на Римската империя младият войник Марк Виниций се влюбва в Лигия – пленената дъщеря на варварски цар. Но той не подозира, че любимата му изповядва християнската вяра, заради която мнозина вече са загубили живота си.\r\n\r\nСъдбите на Виниций и Лигия се преплитат и двамата гледат света, който познават, да се променя пред очите им. А докато апостолите Петър и Павел се опитват да спасят аморалния град от разруха, християните са подложени на жестоки гонения.", 6, "https://cdn.ozone.bg/media/catalog/product/cache/1/image/a4e40ebdc3e371adff845072e1c73f37/q/u/fb2e33e9edf08ab8b8e46d9237e5ab06/quo-vadis-hermes-30.jpg", 560, 24.95m, "Hermes", "Quo Vadis", 2020 },
                    { 8, "Димитър Димов", 2, "Навярно целият нов подход на Димов към романа, новата постройка и неочаквани акценти в „Тютюн“ бяха една от причините той да не бъде разбран още при появата си. Мнозина причисляваха автора към екзотичните цветя, израснали и култивирани не на наша плодотворна културна нива. Но днес е ясно, че с опита си Димитър Димов завеща, а с примера си подкрепи една нова тенденция в националния роман, разшири неговите хоризонти, обогати неговите традиции. В „Тютюн“ зрялата мисъл, вкусът и интелектът на моралиста преодоляват плашещото разстояние между неговите блуждения по чужди светове и нашия собствен национален исторически опит, те са намерили свой език за новия ни национален опит. Преодоляването на това огромно разстояние, необичайната парабола на това пътешествие бяха и преодоляване на смъртта на романа в интелектуалната сухота и умозрителност, откриха нови, не само чисто пластически пътища за развитието на бъдещия български роман и за нашето ново повествователно изкуство.", 6, "https://cdn.ozone.bg/media/catalog/product/cache/1/image/a4e40ebdc3e371adff845072e1c73f37/t/j/1940371da707cb6bf1a3b777c9b3f9f1/tyutyun-komplekt---1-i-2-tom-30.jpg", 864, 45.00m, "Ciela", "Тютюн (Комплект - 1 и 2 том)", 2019 },
                    { 9, "Бритни Спиърс", 2, "„Жената в мен“ е смела и удивително трогателна история за свободата и славата, майчинството и оцеляването, вярата и надеждата! През юни 2021 г. целият свят слушаше със затаен дъх, докато Бритни Спиърс говореше на открито съдебно заседание. Възможността да бъде чута – и да сподели своята истина – имаше неоспоримо въздействие, което промени посоката на нейния живот, както и живота на още много хора. „Жената в мен“ за първи път разкрива нейното невероятно житейско пътешествие – и вътрешната сила на една от най-великите изпълнителки в историята на поп музиката. Написани със забележителна откровеност и хумор, разтърсващите мемоари на Бритни Спиърс осветяват несекващата сила на музиката и любовта и показват колко е важно една жена да разкаже историята си със свои думи, така както тя я вижда. Това се случва сега. Носителката на няколко платинени награди „Грами“, поп-иконата Бритни Спиърс е една от най-успешните и прочути изпълнителки в музикалната история с над 100 милиона продадени плочи. През 2021 г. тя беше обявена от списание „Тайм“ за една от 100-те най-влиятелни хора. През 2012 г. албумът на Спиърс „Затъмнение“ беше прибавен в библиотеката и архивите за рокендрол в Залата на славата. Тя живее в Лос Анджелис, Калифорния.", 10, "https://cdn.ozone.bg/media/catalog/product/cache/1/image/a4e40ebdc3e371adff845072e1c73f37/b/r/219d4cce0a619d1122bab9cd24e91c5e/britni-spiars--zhenata-v-men---avtobiografiya-30.jpg", 240, 19.99m, "Ciela", "Бритни Спиърс: Жената в мен - Автобиография", 2023 },
                    { 10, "Иво Сиромахов", 2, "„Жената в мен“ е смела и удивително трогателна история за свободата и славата, майчинството и оцеляването, вярата и надеждата! През юни 2021 г. целият свят слушаше със затаен дъх, докато Бритни Спиърс говореше на открито съдебно заседание. Възможността да бъде чута – и да сподели своята истина – имаше неоспоримо въздействие, което промени посоката на нейния живот, както и живота на още много хора. „Жената в мен“ за първи път разкрива нейното невероятно житейско пътешествие – и вътрешната сила на една от най-великите изпълнителки в историята на поп музиката. Написани със забележителна откровеност и хумор, разтърсващите мемоари на Бритни Спиърс осветяват несекващата сила на музиката и любовта и показват колко е важно една жена да разкаже историята си със свои думи, така както тя я вижда. Това се случва сега. Носителката на няколко платинени награди „Грами“, поп-иконата Бритни Спиърс е една от най-успешните и прочути изпълнителки в музикалната история с над 100 милиона продадени плочи. През 2021 г. тя беше обявена от списание „Тайм“ за една от 100-те най-влиятелни хора. През 2012 г. албумът на Спиърс „Затъмнение“ беше прибавен в библиотеката и архивите за рокендрол в Залата на славата. Тя живее в Лос Анджелис, Калифорния.", 12, "https://cdn.ozone.bg/media/catalog/product/cache/1/image/a4e40ebdc3e371adff845072e1c73f37/y/-/d93901634b9ba810eb05ed61dc67608a/u-maykini-30.jpg", 352, 15.90m, "Ciela", "У майкини", 2020 },
                    { 11, "Анджей Сапковски", 1, "Гералт от Ривия, Белия вълк, се завръща в книжарниците! 23 години след излизането на „Последното желание” на полски издателство „Сиела“ пуска на пазара книгата, която промени завинаги представите на хората за съвременно фентъзи, умело преплитайки мотиви от класическите приказки, източноевропейската митология и криминалните истории на Реймънд Чандлър. Книгата, която даде началото на поредица, вдъхновила култовата серия от ролеви игри The Witcher, дала ни един от най-иконичните персонажи на развлекателната индустрия – Гералт от Ривия. Той не е герой. Не е рицарят на бял кон, който спасява девойката в последния момент. Той е професионалист, който убива чудовища срещу заплащане. Вещер – един от последните представители на легендарна каста от мутанти, създадени, за да се изправят с меч в ръка срещу всичко, което дебне в мрака, отвъд огньовете на човешките селища. Той е легенда. И това е началото на неговата история!", 3, "https://ciela.bg/wp-content/uploads/2020/07/61078ba28b743deaed799f19905cf6c4.jpg", 316, 25.00m, "Ciela", "Вещерът 1: Последното желание", 2016 },
                    { 12, "Георги Бърдаров", 1, "Историята ни отвежда в един от най-кървавите периоди в историята на Балканите – обсадата на Сараево. Книгата на Бърдаров е история за война и любов, преди всичко за любов, която преминава отвъд времето. Топла майска нощ през 1993 г. Обсадата на Сараево е започнала преди година и краят не се вижда, също както на братоубийствената война между довчерашните съюзни югославски народи. Двойка млади сърби стоят в кухнята си, потънали в мълчание. Давор, християнин, и Айда, мюсюлманка, са съхранили любовта си сред разрухата и безумието, които царят в обсадения град. Знаят, че наближава поредното кратко, едва половинчасово затишие, когато снайперистите почиват. Загледани в стрелките на часовника, те са взели решението да избягат – да достигнат свободата... или да посрещнат смъртта. Двадесет години по-късно българин пътува към Сараево, за да се срещне със сръбския преводач на книгата си. Скоро се озовават в кръчма и неусетно заговарят за войната. С напредването на часовете празните бутилки на масата се увеличават, а отдавна погребани тайни излизат на повърхността. Две нощи. Четири съдби. Всички водещи до най-важните въпроси. Кой запали тази война? И кой спечели от нея?", 15, "https://ciela.bg/wp-content/uploads/2020/07/330956df410727967d0c2b77316a204b.jpg", 182, 14.00m, "Ciela", "Аз още броя дните", 2016 },
                    { 13, "Людмила Филипова", 1, "В романа „Войната на буквите“ неповторимата Людмила Филипова съсредоточава творческия си талант върху един от най-важните моменти в българската история и разкрива житейските битки и предизвикателствата на цар Симеон, синовете му и техните най-големи противници. Създаването, налагането и опазването на българската азбука е дело, с което не просто се гордеем – то ни определя като силен и непоклатим народ. В него обаче има намесена мистика, която остава неразбулена и до днес – кой е Черноризец Храбър и каква е скритата сила на буквите? Това е тайна, която преобръща съдбата на хиляди, предрешава битки и дарява неземни сили. Власт, любов, манипулацияи епични битки се преплитат в историческия роман, разкриващ тайнствените събития зад един от най-емблематичните периоди в българската история. И едно от най-великите дела на българския народ и неговите апостоли на буквите.", 3, "https://www.ciela.com/media/catalog/product/e/n/enthusiast_voynata-na-bukvite_otkas-01.jpg", 552, 22.00m, "Enthusiast", "Войната на буквите", 2019 },
                    { 14, "Сюзан Колинс", 1, "В руините на някогашната Северна Америка се намира държавата Панем с блестящата си столица Капитол и дванайсетте ѝ окръга. Капитолът е безмилостен и държи окръзите в подчинение, като ги принуждава да изпращат по едно момче и едно момиче на възраст между дванайсет и осемнайсет за ежегодните Игри на глада - риалити шоу, предавано на живо по телевизията. Катнис Евърдийн знае, че подписва смъртната си присъда, когато доброволно заема мястото на по-малката си сестра в Игрите. Катнис неведнъж е била близо до смъртта - и оцеляването се е превърнало в нейна втора природа. Но ако иска да победи, ще се наложи да избира между оцеляването и човечността, между живота и любовта. Сюзан Колинс поднася равни части съспенс и философия, приключения и любов в този изпепеляващ роман, чието действие се развива в едно бъдеще, обезпокоително напомнящо нашето настояще. Победата означава богатство и слава. Загубата означава сигурна смърт. Игрите на глада започват...", 13, "https://cdn.ozone.bg/media/catalog/product/cache/1/image/9df78eab33525d08d6e5fb8d27136e95/i/g/21c0fb1dee462cdb569e1abe136df330/igrite-na-glada-30.jpg", 376, 14.90m, "Екслибрис", "Игрите на глада", 2015 },
                    { 15, "Сюзан Колинс", 1, "В руините на някогашната Северна Америка се намира държавата Панем с блестящата си столица Капитол и дванайсетте й окръга. Капитолът е безмилостен и държи окръзите в подчинение, като ги принуждава да изпращат по едно момче и едно момиче на възраст между дванайсет и осемнайсет на ежегодните Игри на глада - риалити шоу, предавано на живо по телевизията. В Игрите може да победи само един. И гледането е задължително! Колкото и да е невероятно, Катнис Евърдийн е победител в Игрите на глада. А победата означава богатство и слава. Сега Катнис би трябвало да е щастлива - в края на краищата пак е при семейството си и стария си приятел Гейл. Но нищо не е точно така, как тя иска. И се носят слухове за бунт срещу Капитола - бунт, за който Катнис може би е допринесла. Във втората част от трилогията \"Игрите на глада\" Сюзан Колинс продължава разказа за Катнис, като я подлага на още повече изпитания и поднася изненади на всяка страница.", 13, "https://cdn.ozone.bg/media/catalog/product/cache/1/image/9df78eab33525d08d6e5fb8d27136e95/i/g/a25f88a9f0259f66c7f210909fbba17f/vazplamenyavane-igrite-na-glada-2-31.jpg", 384, 14.90m, "Екслибрис", "Възпламеняване (Игрите на глада 2)", 2015 },
                    { 16, "Сюзан Колинс", 1, "Окръг 12, родното място на Катнис Евърдийн, огненото момиче, е унищожен, но тя е жива. Гейл е избягал. Семейството на Катнис е в безопасност. Пийта е в ръцете на Капитола. Окръг 13 наистина съществува, има бунтовници, има нови лидери. Революцията се разгаря. Сега успехът на въстанието зависи от готовността на Катнис да се подчини, да поеме отговорност за живота на безброй хора и да промени бъдещето на Панем. За да го направи, тя трябва да преодолее гнева и недоверието си и да стане Сойка-присмехулка - символ на въстанието - каквато и да е цената лично за нея. Зашеметяващият завършек на трилогията „Игрите на глада“.", 13, "https://www.ciela.com/media/catalog/product/1/1/112444.jpeg", 384, 14.90m, "Екслибрис", "Сойка-присмехулка (Игрите на глада 3)", 2015 },
                    { 17, "Сюзан Колинс", 1, "Сутринта на Жътвата, с която започват десетите „Игри на глада\". В Капитола осемнайсетгодишният Кориолан Сноу се подготвя за този единствен шанс да спечели слава като ментор в Игрите. За някога могъщата фамилия Сноу са настъпили трудни времена и съдбата й зависи от нищожния шанс Кориолан да успее да бъде по-чаровен, по-умен и по-изобретателен от съучениците си, за да стане ментор на трибута победител. Вероятността да спечели е малка. Пада му се унизителната задача да бъде ментор на момичето трибут от Окръг 12, най-незначителния от всички. Съдбите на двамата сега са напълно преплетени - всяко решение на Кориолан може да доведе до победа или провал, триумф или поражение. На арената битката ще бъде на живот и на смърт. Извън арената Кориолан започва да съчувства на обречения си трибут... и трябва да балансира между потребността си да следва правилата и желанието да оцелее на всяка цена.", 13, "https://img.cms.bweb.bg/media/images/640x/Nov2023/2113171734.webp", 492, 20.00m, "Екслибрис", "Балада за пойни птици и змии (Игрите на глада) - филмова корица", 2019 }
                });
        }

        protected override void Down(MigrationBuilder migrationBuilder)
        {
            migrationBuilder.DeleteData(
                table: "Books",
                keyColumn: "Id",
                keyValue: 6);

            migrationBuilder.DeleteData(
                table: "Books",
                keyColumn: "Id",
                keyValue: 7);

            migrationBuilder.DeleteData(
                table: "Books",
                keyColumn: "Id",
                keyValue: 8);

            migrationBuilder.DeleteData(
                table: "Books",
                keyColumn: "Id",
                keyValue: 9);

            migrationBuilder.DeleteData(
                table: "Books",
                keyColumn: "Id",
                keyValue: 10);

            migrationBuilder.DeleteData(
                table: "Books",
                keyColumn: "Id",
                keyValue: 11);

            migrationBuilder.DeleteData(
                table: "Books",
                keyColumn: "Id",
                keyValue: 12);

            migrationBuilder.DeleteData(
                table: "Books",
                keyColumn: "Id",
                keyValue: 13);

            migrationBuilder.DeleteData(
                table: "Books",
                keyColumn: "Id",
                keyValue: 14);

            migrationBuilder.DeleteData(
                table: "Books",
                keyColumn: "Id",
                keyValue: 15);

            migrationBuilder.DeleteData(
                table: "Books",
                keyColumn: "Id",
                keyValue: 16);

            migrationBuilder.DeleteData(
                table: "Books",
                keyColumn: "Id",
                keyValue: 17);

            migrationBuilder.UpdateData(
                table: "AspNetUsers",
                keyColumn: "Id",
                keyValue: "6d5800ce-d726-4fc8-83d9-d6b3ac1f591e",
                columns: new[] { "ConcurrencyStamp", "PasswordHash", "SecurityStamp" },
                values: new object[] { "822aafa1-a934-46cc-acfd-736b5343040b", "AQAAAAEAACcQAAAAEGnvIl4V0xakz9cyfldfiegRY2U4ueTNAopBrXelsn14pHR4VupYsRbAkID6fM0Oew==", "ccc37d36-957b-48ce-b11a-0419bedd80fa" });

            migrationBuilder.UpdateData(
                table: "AspNetUsers",
                keyColumn: "Id",
                keyValue: "c2f14bf7-ffdd-47a4-90b3-f2309486fae9",
                columns: new[] { "ConcurrencyStamp", "PasswordHash", "SecurityStamp" },
                values: new object[] { "fba58968-7c4c-4f63-98cf-c59ec62684cd", "AQAAAAEAACcQAAAAENFC1MyiS4ANh8wcZ6CaQBaBCIbTr2FxRbaksBJV4LTnha3VxBzv2mtMae8oQnNRMQ==", "3929b346-76ea-4ed4-8dbc-8393cc6ec121" });

            migrationBuilder.UpdateData(
                table: "AspNetUsers",
                keyColumn: "Id",
                keyValue: "dea12856-c198-4129-b3f3-b893d8395082",
                columns: new[] { "ConcurrencyStamp", "PasswordHash", "SecurityStamp" },
                values: new object[] { "09d5b7ad-3e06-4da6-b632-25f67572c50a", "AQAAAAEAACcQAAAAEB+plFpgI3r0XCjnKv4uihVURWohAZLM6PzCSYeIgGSVAS/tBazL1RjVR66HgrXATQ==", "8502b394-96de-40ce-b104-f3173ed55d08" });
        }
    }
}
