using System;
using Microsoft.EntityFrameworkCore.Migrations;

#nullable disable

namespace NovelNest.Infrastructure.Migrations
{
    public partial class SeededMoreArticles : Migration
    {
        protected override void Up(MigrationBuilder migrationBuilder)
        {
            migrationBuilder.InsertData(
                table: "Articles",
                columns: new[] { "Id", "Content", "DatePublished", "ImageUrl", "Title", "ViewsCount" },
                values: new object[,]
                {
                    { 4, "Британският писател от индийски произход Салман Рушди, човек с неподкупна съвест, непримирим към всяка форма на диктатура и ограничаване на свободата на словото, беше удостоен с Наградата за мир на Германската асоциация на книгоиздателите и книгоразпространителите по време на Панаира на книгата във Франкфурт. Това е едно от най-значимите германски отличия, присъдено за пръв път през 1950 година. С него Рушди се присъединява към писатели като Маргарет Атууд, Орхан Памук, Сюзън Зонтаг, Амос Оз, Вацлав Хавел.\r\n\r\nЖурито обяви, че писателят е бил избран заради несломимия си дух, последователното утвърждаване на живота и обогатяването на света с любов към разказването на истории: „В своите романи и в мемоарната си литература той съчетава прозорливост на разказа с непогрешимо новаторство, хумор и мъдрост“. Възхвалявайки Рушди в речта си, неговият приятел и колега, писателят Даниел Келман, го определи като „вероятно най-важния бранител на свободата на изкуството и словото на нашето време“.\r\n\r\nРушди, който безсъмнено е един от най-изкусните и омагьосващи разказвачи днес, благодари за наградата, но отбеляза, че „мирът в момента изглежда като фантазия, родена от употребата на наркотик\" В речта си в църквата „Свети Павел\" 76-годишният автор на „Сатанински строфи“ и „Кишот“ осъди войната на Русия срещу Украйна като следствие от „ненаситната жажда за власт и завоевания на един тиранин“ и изрази надежда, че терорът в Близкия изток ще бъде прекратен възможно най-скоро.\r\n\r\n„Не съм допускал, че ще доживея такова време. Време, в което свободата - по-специално свободата на словото, без която светът на литературата не би могъл да съществува - навсякъде е атакувана от реакционни, авторитарни, популистки, демагогски, полуобразовани, нарцистични, безразсъдни гласове.\"\r\n\r\nРушди не спести критиките си и по отношение на американската политическа действителност. Пред журналисти той изрази разочарованието си от Републиканската партия, която според него е обърнала гръб на демократичните стойности за сметка на култа към една личност. Също толкова тревожна според него е ситуацията и в Индия, където е роден. „Всеки журналист или писател, който изгуби симпатиите или се възпротиви на властите – казва Рушди – се озовава под заплаха.”\r\n\r\nАвтор на тринайсет романа, Салман Рушди добива световна известност с алегоричния шедьовър Midnight Children (1981), за който получава няколко отличия, в т.ч. награда „Букър“. Книгата два пъти печели и т.нар. Букър на всички Букъри, през 1993 г. и 2008 г., по случай 25-ата и 40-ата годишнина на наградата, а през 2012 г. е адаптирана за голям екран като колаборация между Канада, Великобритания, САЩ и Индия под режисурата на Дийпа Мехта. Посветен на годините, в които Индия се освобождава от британския колониализъм, романът е издаден у нас за пръв път през 2003 г. от „Постскриптум“ със заглавие „Среднощни деца“. На 3 ноември 2023 г. „Колибри“ пуска ново издание, озаглавено „Родените в полунощ“, в превод на Надежда Розова. Промяната на заглавието не е случайна, както става ясно от предговора на книгата, подписан от писателя.\r\n\r\nПрез 1988 г. романът „Сатанински строфи“ на Рушди предизвиква бурни реакции в ислямския свят, книгата е забранена в много страни, а иранският аятолах обявява автора за вероотстъпник и определя голяма парична награда за убийството му. През август 2022 г. срещу писателя е извършено покушение – той е намушкан с нож, докато изнася лекция на сцената на литературен фестивал в щата Ню Йорк. След тази брутална атака, която го оставя сляп с дясното око и с осакатена лява ръка, писателят написва есето „Нож: Размисли след опит за убийство“, чиято премиера се очаква на 16 април 2024 г. За Рушди тази мемоарна книга е начин „да се отговори на насилието с изкуство“.\r\n\r\nИздателство „Колибри“ ще предложи на българските читатели и най-новата му художествена творба,  Victory City („Град на победата“). Разказвайки история за възхода и падението на една феминистка утопия, романът смесва политически интриги и религиозен фанатизъм и завършва със знаковата фраза: „Думите са победителят“.", new DateTime(2024, 4, 10, 19, 34, 0, 0, DateTimeKind.Unspecified), "https://www.colibri.bg/news_img/20231027_1.jpg", "Салман Рушди отговаря на насилието с изкуство", 0 },
                    { 5, "Навръх Международния ден на преводача, 30 септември, на специална церемония в Аудитория 65 на Ректората на СУ „Св. Климент Охридски“ Съюзът на преводачите в България връчи Годишните награди за превод в различни категории.\r\n\r\nИмаме удоволствието да съобщим, че жури в състав Галина Меламед, Людмил Димитров и Дарин Тенев присъди тазгодишната Специална награда за изключително високи постижения в областта на превода на художествена литература (поезия) на Силвия Вагенщайн – за превода ѝ от френски език на концептуално подбраните от нея стихове на Пол Елюар в „Поезия“, предадени с пълната авторова гама от образи, мелодика, поетични послания на също толкова богат и образен български език.\r\n\r\nОсвен че е автор на конгениалния превод, Силвия Вагенщайн стои зад съставителството, предговора и бележките към това изящно издание, което предлага екстракт от 14 поетически книги на големия френски творец.\r\n\r\nЕто ги и мотивите на журито: „Преводачката Силвия Вагенщайн ни поднася концептуално томче с избрана поезия от Пол Елюар, необременена от идеологически напластявания, каквито се натрупват през живота му и които са били най-честото оправдание за редките му и не особено запомнени появи на български език. Издържан и великолепно изтълкуван, настоящият Елюар е избор и лична антология на Вагенщайн, която тя иска да сподели с читателите си. В своето време нещо подобно прави и самият френски поет, поднасяйки на сънародниците си стихотворенията на Христо Ботев. А Ботев винаги е достатъчно основание тук, в България, да забележим неговия чуждестранен популяризатор. В случая обаче това е по-незначителна и периферна подробност. Далеч по-важни са езиковите и образни енергийни конвулсии, трептения и трусове, оцелели в превода, мелодиката и особено личното, интимно послание, успоредено с компетентния предговор от преданата преводачка. Не е маловажен и фактът, че една откровено мъжка поезия е интерпретирана от дама, придала особена рафинираност на стиха, без да го изравнява, манипулира или „феминизира“. Елюар звучи убедително, възприемателят не го чете, а събеседва с него, слуша го и съпреживява довереното му като свое.“\r\n\r\nПо традиция бяха присъдени и награди за ярки постижения в областта на превода на художествена литература. Сред отличените заслужено се нареди Илияна Чалъкова за превода на антиутопичния роман „Пещерата“ от Жозе Сарамаго, един покъртително човеколюбив и ярък прочит на Платоновия мит за пещерата и сенките.\r\n\r\nОбосновката на журито гласи: „Преводачката се е справила превъзходно с пресъздаването на български на плътния стил на големия португалски писател. В превода си е успяла да съхрани почерка, като намери най-хубава форма за предаване на особения синтактичен ритъм на Жозе Сарамаго, който е известен с дългите си изречения, с вплитането на диалози в потока на едно изречение, с реторичните натрупвания (синатроезми) и обратите на изказа. И това е постигнато на един четивен и красив български език, образец за преводаческо майсторство.“\r\n\r\nМариана Неделчева беше удостоена с награда за ярки постижения в областта на превода на хуманитаристика за съставителството и превода от английски език на книгата „Изящното изкуство на критиката“ от Хенри Джеймс. Според журито преводът предава майсторски всички черти на авторовия стил, в който фразите се открояват със своята точност и красота.\r\n\r\nВасил Самоковлиев беше отличен с награда за цялостна дейност в областта на превода за неговите майсторски преводи на значими романи от съвременната чешка литература и за дългогодишната му преподавателска дейност по теория и практика на превода на български и чуждестранни студенти. Напомняме, че Самоковлиев е сред българските преводачи на двамата колоси на европейската литература Бохумил Храбал и Милан Кундера. В негов превод наскоро излязоха „Сватби в къщата“ и „Vita Nuova” от автобиографичната трилогия на Храбал, предстои да излезе романът „Пролуки“.\r\n\r\nЧестито на всички наградени преводачи!", new DateTime(2024, 4, 11, 13, 14, 0, 0, DateTimeKind.Unspecified), "https://www.colibri.bg/news_img/202301002_1.jpg", "Силвия Вагенщайн със специална награда от Съюза на преводачите", 0 },
                    { 6, "На стогодишна възраст ни напусна Анжел Вагенщайн, един от най-ярките интелектуалци на нашето съвремие.\r\n\r\nЧовек епоха. Личност с пословичен интегритет, дух и мъдрост, дала живот на десетки киносценарии, неотехтели речи, прозорливи „драскулки“ и на признатия в цял свят белетристичен триптих „Петокнижие Исааково“, „Далеч от Толедо“ и „Сбогом, Шанхай“, посветен на съдбата на европейските евреи през Втората световна война…\r\n\r\nОбгрижвайки думите, подреждайки ги с топлота и отговорност като бисери в огърлицата на паметта, Вагенщайн ни завеща пленителен разказ за мътния въртоп на една преломна епоха, за пъстротата на човешките характери и за краха на илюзиите, за сложния възел на живота, който е безсърдечно кратък, а човешката надежда – неутолима.\r\n\r\nИзпитанията, които не успяха да съкрушат вярата му в един по-справедлив световен ред, нито разколебаха непримиримостта му към тиранията, днес напомнят за прочутата еврейска поговорка „Пепелта е по-достолепна от пясъка – защото е горяла.“\r\n\r\nИ ако вземем назаем частица от гениалното му красноречие, ще кажем, че творчеството му е „едно ситно написано любовно писмо - закодирано признание в привързаност и дори обич – към теб, читателю, към всички хора с добра воля и към онзи непоносим, но скъп на сърцето ни нахалник, живота, който ни досажда непрекъснато, докато милостивата случайност един ден не го изрита... “\r\n\r\nОт нас се очаква само да се научим да четем.\r\n\r\nПоклонението ще се състои в Софийската синагога на трийсетия ден от смъртта, както повелява еврейската традиция.\r\n\r\nПоклон пред паметта на човека и твореца Анжел Вагенщайн, оставил трайна диря в българската култура!", new DateTime(2024, 4, 12, 9, 46, 0, 0, DateTimeKind.Unspecified), "https://www.colibri.bg/news_img/20230629_1.jpg", "Анжел Вагенщайн пое към вечността", 0 },
                    { 7, "Седмият роман от хитовата поредица за Корморан Страйк ще има своята световна премиера на 26 септември 2023 г., т.е. в годината, в която се навършва точно едно десетилетие от излизането на първия бестселър – „Зовът на кукувицата“.\r\n\r\nТази есен Sphere, импринт на Little, Brown Book Group, ще издаде The Running Grave (буквално „Бягащият гроб“) от Робърт Галбрейт, псевдоним на Дж. К. Роулинг. По традиция са предвидени печатно, електронно и аудио издание.\r\n\r\n„Бягащият гроб“ ще бъде седмо поред заглавие в планирана серия от десет книги, при това и шестте предходни заглавия се превърнаха в международни бестселъри. Поредицата за Корморан Страйк и Робин Елакот е определяна като „изключително увлекателна“ (Дейли Експрес), „дело на майстор разказвач“ (Дейли Телеграф) и „изумително криминално творчество“ (Санди Таймс), а протагонистите Страйк и Робин са „един от най-ангажиращите дуети в криминалната литература“ (Гардиан).\r\n\r\n„Зовът на кукувицата“ получи наградата Nielsen Platinum, защото надхвърли 1 000 000 продадени копия. „Копринената буба“ и „В служба на злото“, съответно втори и трети роман от поредицата, вече достигнаха рекорда за бестселъри Nielsen Gold с над 500 000 продадени екземпляра от всяко заглавие.\r\n\r\n„Беше прекрасно преживяване да сме свидетели на неимоверния успех на книгите на Робърт Галбрейт през последните десет години. За нас е чест да ги издаваме. С над 11 милиона продадени копия на английски език до момента, историята на Страйк и Робин продължава да владее въображението на читателите и аз, също като тях, нямам търпение да видя какво ще се случи в последните четири книги от поредицата“, признава Дейвид Шели, главен изпълнителен директор на Hachette UK.\r\n\r\n„Такова удоволствие е да знаеш, че предстои нов трилър от Робърт Галбрейт! Със седем романа зад гърба си Дж. К. Роулинг вече е усъвършенствала до блясък умението да създава драма, емоция, нaпрежение. Тя показа на читателите, че е в състояние да улови безкрайната сложност на човешкия дух, неговите тъмни и светли страни“, споделя Майкъл Пийч, главен изпълнителен директор на Hachette Book Group.\r\n\r\nНа български език са издадени шестте книги от поредицата дотук, предстои да излезе и седмият роман. С огромен успех се ползва и телевизионният сериал с главни герои Страйк и Робин, продуциран от Brontë Film and Television.", new DateTime(2024, 4, 13, 11, 20, 0, 0, DateTimeKind.Unspecified), "https://www.colibri.bg/news_img/20230505_1.jpg", "Нова книга от серията на Робърт Галбрейт се очаква през септември", 0 },
                    { 8, "Вече е факт единствената българска книжарница с имплементирана 360-градусова виртуална реалност - Либрария, https://www.colibri.bg/libraria/. Тя е интегрална част от уебстраницата на издателство „Колибри“. До виртуалната книжарница се стига чрез посочения линк или от менюто на colibri.bg. Освен че ще предлага изключителна възможност за подбор и закупуване на книги във виртуална среда за първи път в България, а може би и в света, тази интегрирана функционалност към уебсайта на издателството ще предоставя бонус под формата 10% допълнителна отстъпка  върху абсолютно всички текущи намаления на основния сайт!\r\n\r\n360-градусовата разходка представлява уникално, почти сюрреалистично приключение в компанията на заглавия от най-различни жанрове, дело на всепризнати творци и мислители. Пресъздавайки интериора на физическа книжарница, триизмерната визуализация осигурява опит, който е максимално близък до сетивния. Благодарение на технологията VR интерактивното преживяване позволява 360-градусова разходка в отлично построено виртуално пространство, фактически достъп до всеки продукт, реален избор на книги и оптимизиран процес на покупка. А тази възможност е неоценима при дефицит на време и в периоди, в които спокойната разходка в градска среда е възпрепятствана по една или друга причина.\r\n\r\nЛибрария е първата по рода си виртуална книжарница - същинска литературна вселена, в която всеки обект е своеобразен микрокосмос. Покана за смислено развлечение, адресирана към всеки буден ум, но и към всички онези подрастващи читатели, инстинктивно устремени към голямата литература. На разположение ще бъдат всички налични заглавия на издателство „Колибри“ - шедьоври на световната белетристика, класическа поезия, отбрана съвременна европейска и българска проза, изобретателни трилъри, неустоими предложения за деца, научни трудове, есета и документалистика, езикови системи и учебни помагала… Специално внимание заслужават изданията от емблематичната поредица „Амаркорд“, побрала разтърсващи изповеди на най-влиятелните фигури в световното киноизкуство.\r\n\r\nНа една от „стените“ в тази удивителна книжарница неслучайно се мъдрят думите на визионера Федерико Фелини: „Няма нищо по-честно от една мечта.“ Защото единствените граници на човешкото същество са границите на неговата фантазия, а тя може да бъде отключена от съприкосновението с хубави книги.\r\n\r\nНа добър час из виртуалните селения на литературата, която произвежда мечти!", new DateTime(2024, 4, 14, 17, 3, 0, 0, DateTimeKind.Unspecified), "https://www.colibri.bg/news_img/20220715_1.jpg", "Първата книжарница с 360-градусова виртуална реалност", 0 },
                    { 9, "На тържествена церемония в Стария град на Пловдив бяха обявени тазгодишните лауреати на националната награда „Христо Г. Данов“, която се връчва за принос в българската книжовна култура. \r\n\r\nСтатуетката за преводач на художествена литература отиде при Васил Самоковлиев, който беше отличен за блестящия превод на новелата „Сватби в къщата“ от Бохумил Храбал.\r\n\r\n„Сватби в къщата“ е ироничен портрет на артистичния живот в следвоенна Източна Европа и красноречиво свидетелство за това как личната история на един артист може да бъде преработена и излята в бляскава форма със средствата на литературата. Наративът сдвоява мъжката и женската визия за света - те се преливат една в друга виртуозно и се раздалечават също толкова естествено като илюстрация на неповторимата творческа индивидуалност на автора.\r\n\r\nВ категорията „Художник или дизайн и оформление на книга“ наградата отиде при Ясен Гюзелев заради възхитителното издание „Орфей и Евридика“.\r\n\r\nИсторията за Орфей и Евридика е един от най-тъжните митове в цялата гръцка митология. В изданието на „Колибри“ тя е вълнуващо онагледена с авторските илюстрации на Ясен Гюзелев. Художественото оформление е дело на Кирил Златков. За високото качество на изданието роля има и безупречният текст на Иван Б. Генов.\r\n\r\nС наградата за цялостен принос в българската книжовна култура посмъртно бе удостоен Марин Бодаков.\r\n\r\nТазгодишното жури беше представено от: Юрий Вълковски – зам.-министър на културата, Пламен Панов, зам.-кмет на Община Пловдив, Антон Баев, д-р Силва Хачерян, началник отдел \"Регионални дейности\" в МК, Димитър Минев, директор на НБ \"Иван Вазов\" – Пловдив, Бойко Ламбовски, проф. Магдалена Костова-Панайотова, Иван Есенски, Тоня Горанова. \r\n\r\nНаградите \"Христо Г. Данов\" се организират от Министерството на културата и Община Пловдив. Лауреатите на престижното отличие получават диплом, малка пластика и парична награда. Наградите се връчват ежегодно по случай 24 май - Ден на светите братя Кирил и Методий, на българската азбука, просвета и култура и на славянската книжовност.", new DateTime(2024, 3, 12, 16, 20, 0, 0, DateTimeKind.Unspecified), "https://www.colibri.bg/news_img/20220616_1.jpg", "Две награди „Христо Г. Данов“ за издания на „Колибри“", 0 }
                });

            migrationBuilder.UpdateData(
                table: "AspNetUsers",
                keyColumn: "Id",
                keyValue: "64ce3106-ec7d-44cb-b167-bf946b88bb1b",
                columns: new[] { "ConcurrencyStamp", "PasswordHash", "SecurityStamp" },
                values: new object[] { "990f78f6-0cdd-49e0-88f4-ac3a0b52c80e", "AQAAAAEAACcQAAAAEGks5i9gvEcQeua9x+iBkynuXbzcRoroDhEuCc6PFqtjedx4s5ckKjNbjL/TayrdBQ==", "159746f4-1fca-4b47-8d57-8e5b45cb0ce7" });

            migrationBuilder.UpdateData(
                table: "AspNetUsers",
                keyColumn: "Id",
                keyValue: "6d5800ce-d726-4fc8-83d9-d6b3ac1f591e",
                columns: new[] { "ConcurrencyStamp", "PasswordHash", "SecurityStamp" },
                values: new object[] { "69178d1a-f5dc-44cd-bad3-2cb4a4c3189a", "AQAAAAEAACcQAAAAEBR8fuDVqUFuGRWOgDhuugxN1woTvM6sTPx8y6dsVKQpRvQ1+ItRzHWE3762ISBETA==", "2a83e624-a890-4445-bbfa-bf86698d2f03" });

            migrationBuilder.UpdateData(
                table: "AspNetUsers",
                keyColumn: "Id",
                keyValue: "c2f14bf7-ffdd-47a4-90b3-f2309486fae9",
                columns: new[] { "ConcurrencyStamp", "PasswordHash", "SecurityStamp" },
                values: new object[] { "db51db50-0343-4822-a88d-0b7470d1f1bb", "AQAAAAEAACcQAAAAEKIVm3lE6mNHm9iw6PjrGUc38WgxV1LHxLTT3QiijLytz+caqEqoxjquxmroto/Nzg==", "63516e9a-ad44-4f65-8d29-23f3279a68d8" });

            migrationBuilder.UpdateData(
                table: "AspNetUsers",
                keyColumn: "Id",
                keyValue: "cabfd9b8-4411-47f6-9639-df70d753c275",
                columns: new[] { "ConcurrencyStamp", "PasswordHash", "SecurityStamp" },
                values: new object[] { "24559cf7-a868-4475-96ec-d5d3a93adc4f", "AQAAAAEAACcQAAAAENoKirKK4+djAqIH2/Vyd7MXQNuZsAqk5c4FsAlDfc+G4tm+ZqC6X2O7c0CL60CL9Q==", "6b507bd7-4e87-4b29-8944-37ca22568d70" });

            migrationBuilder.UpdateData(
                table: "AspNetUsers",
                keyColumn: "Id",
                keyValue: "dea12856-c198-4129-b3f3-b893d8395082",
                columns: new[] { "ConcurrencyStamp", "PasswordHash", "SecurityStamp" },
                values: new object[] { "49a35917-3d9d-48db-b3a6-019f1476e3db", "AQAAAAEAACcQAAAAEOq9oMTxsCdS6UDWTWBNdQb84CccDn2QFhKBPEPSN7Nu6tiWsOTpwBkU7ny9nw09Xg==", "16ba008d-9f06-4f9d-a089-2fef23bcfe28" });
        }

        protected override void Down(MigrationBuilder migrationBuilder)
        {
            migrationBuilder.DeleteData(
                table: "Articles",
                keyColumn: "Id",
                keyValue: 4);

            migrationBuilder.DeleteData(
                table: "Articles",
                keyColumn: "Id",
                keyValue: 5);

            migrationBuilder.DeleteData(
                table: "Articles",
                keyColumn: "Id",
                keyValue: 6);

            migrationBuilder.DeleteData(
                table: "Articles",
                keyColumn: "Id",
                keyValue: 7);

            migrationBuilder.DeleteData(
                table: "Articles",
                keyColumn: "Id",
                keyValue: 8);

            migrationBuilder.DeleteData(
                table: "Articles",
                keyColumn: "Id",
                keyValue: 9);

            migrationBuilder.UpdateData(
                table: "AspNetUsers",
                keyColumn: "Id",
                keyValue: "64ce3106-ec7d-44cb-b167-bf946b88bb1b",
                columns: new[] { "ConcurrencyStamp", "PasswordHash", "SecurityStamp" },
                values: new object[] { "b55002e2-21aa-442a-8fe8-8aaff81b313c", "AQAAAAEAACcQAAAAEP51GE+rXfclERmxhGclE0KL+DkN1TOVPP/R8W5avD4dkS7TsTigD6mwgNhaZiXt4w==", "a19a3321-64ec-46c5-a1d1-a238ff29a079" });

            migrationBuilder.UpdateData(
                table: "AspNetUsers",
                keyColumn: "Id",
                keyValue: "6d5800ce-d726-4fc8-83d9-d6b3ac1f591e",
                columns: new[] { "ConcurrencyStamp", "PasswordHash", "SecurityStamp" },
                values: new object[] { "7a494e5a-a98e-4f8d-98ee-3e4a8cbc699b", "AQAAAAEAACcQAAAAEJcc5zt2HJD5OKZG21sWnHgUwVFF1Igj4O3Z/4+VYc5ZBgDbRnmA3Ji8A2ODZA/rDg==", "fc0e8a2d-7dd5-48d7-baac-8eb23777e403" });

            migrationBuilder.UpdateData(
                table: "AspNetUsers",
                keyColumn: "Id",
                keyValue: "c2f14bf7-ffdd-47a4-90b3-f2309486fae9",
                columns: new[] { "ConcurrencyStamp", "PasswordHash", "SecurityStamp" },
                values: new object[] { "ad161076-3b0c-40a4-a424-f78dae1b4c2a", "AQAAAAEAACcQAAAAEBrr01vv9I5a6cjPGudq3AH0a/kzcukxdw9lHlNcWnWIDVRs+lLnVCPQJRakp76PNQ==", "b4a47c3c-ebe6-4fd8-8d56-49365951d5c5" });

            migrationBuilder.UpdateData(
                table: "AspNetUsers",
                keyColumn: "Id",
                keyValue: "cabfd9b8-4411-47f6-9639-df70d753c275",
                columns: new[] { "ConcurrencyStamp", "PasswordHash", "SecurityStamp" },
                values: new object[] { "f253d0c1-3b43-47e8-87c2-de105201af2a", "AQAAAAEAACcQAAAAEEcw8iFa3joUCCZbB+7fTUTgtS4aWZpKtmG7Ry5pF9u9kfLVa35GxvrBM64U/oTpGA==", "2952f55c-2b51-4a5c-a261-c7f9f41e390b" });

            migrationBuilder.UpdateData(
                table: "AspNetUsers",
                keyColumn: "Id",
                keyValue: "dea12856-c198-4129-b3f3-b893d8395082",
                columns: new[] { "ConcurrencyStamp", "PasswordHash", "SecurityStamp" },
                values: new object[] { "d6214e6f-bee3-4304-bdd2-41b9702e0149", "AQAAAAEAACcQAAAAEN+ojdQgSjLNj8qBD/qrZnhI6LE3eFox3cLVyWkP79qawWWyu7WPgHkLfDNMCCelQA==", "13deca83-2207-4d74-8e92-ff59bf8a7c39" });
        }
    }
}
